config/.config/doom/doom.org
* General configuration
My profile setup:
#+begin_src emacs-lisp :tangle config.el
(setq user-full-name "XiongChenYu"
      user-mail-address "xiongchenyu6@gmail.com")

(setq auth-sources '("~/.authinfo.gpg")
      auth-source-cache-expiry nil)
#+end_src
** Emacs & Doom emacs ui setup:
#+begin_src emacs-lisp :tangle config.el
(setq
      doom-font (font-spec :family "JetBrains Mono" :size 14)
      doom-unicode-font (font-spec :family "DejaVu Sans" :size 14)
      doom-modeline-github t
      doom-modeline-major-mode-color-icon t
      doom-modeline-enable-word-count t
      ;; doom-modeline-minor-modes t
      doom-modeline-indent-info t)

(scroll-bar-mode -1)        ; Disable visible scrollbar
(tool-bar-mode -1)          ; Disable the toolbar
(tooltip-mode -1)                      ; Disable tooltips
(menu-bar-mode -1)

;; Set up the visible bell
(setq visible-bell t)
(setq indent-guide-global-mode t)

(global-auto-revert-mode)
;; (setq org-ditaa-jar-path "/usr/share/java/ditaa/ditaa-0.11.jar")

(add-hook 'shell-mode-hook 'ansi-color-for-comint-mode-on)

(setq display-line-numbers-type 'relative)

(setq url-debug t)

(setq-default fill-column 120)

(setq +lookup-open-url-fn #'+lookup-xwidget-webkit-open-url-fn)

;; (add-hook 'emacs-startup-hook (lambda () (normal-erase-is-backspace-mode +1)))

(if (not (display-graphic-p)) (setq normal-erase-is-backspace t))
;;
(setq mouse-avoidance-mode 'banish)

(+global-word-wrap-mode)
#+end_src
*** GUI Window adjustment
Set frame transparency and maximize windows by default.

#+begin_src emacs-lisp :tangle config.el
(set-frame-parameter (selected-frame) 'alpha '(90 . 90))
(add-to-list 'default-frame-alist '(alpha . (90 . 90)))
(set-frame-parameter (selected-frame) 'fullscreen 'maximized)
(add-to-list 'default-frame-alist '(fullscreen . maximized))
#+end_src

I don't like confirmations or any other type of prompt
#+begin_src emacs-lisp :tangle config.el

(setq compilation-read-command nil)
(setq confirm-kill-emacs nil)
#+end_src

#+begin_src emacs-lisp :tangle packages.el
;;; Examples:
;; (package! another-package :recipe (:fetcher github :repo "username/repo"))
;; (package! builtin-package :disable t)
;; (package! ox-confluence-en :recipe (:host github :repo "correl/ox-confluence-en"))
(package! systemd)
(package! j-mode)
#+end_src
** encrypt
#+begin_src emacs-lisp
(setq epg-gpg-program "gpg")

#+end_src

* Vim
Try transfer more usage experience from vim
** Vim equivalent Escape
#+begin_src emacs-lisp :tangle config.el
;; (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
(global-set-key (kbd "C-[") 'keyboard-escape-quit)
#+end_src
** Vim like window movement
Use *Ctrl* + vim motion key
#+begin_src emacs-lisp :tangle config.el
;; (map!
;;  ;; Easier window movement
;;  :n "C-h" 'evil-window-left
;;  :n "C-j" 'evil-window-down
;;  :n "C-k" 'evil-window-up
;;  :n "C-l" 'evil-window-right
;;  :n "C-q" 'delete-window

;;  (:map evil-treemacs-state-map
;;   "C-l" 'evil-window-right)
;;  )
#+end_src
** tabline.vim
Tab motion keys
#+begin_src emacs-lisp :tangle config.el
(setq centaur-tabs-set-icons t)
(define-key evil-normal-state-map (kbd "g t")
  'centaur-tabs-forward)
(define-key evil-normal-state-map (kbd "g T")
  'centaur-tabs-backward)
#+end_src
** Number in place increase
Used to use this key binding to increase number in vim a lot.
#+begin_src emacs-lisp :tangle config.el
;; , ', ,@ must be used inside `() directly otherwise you should use apply func
(defmacro set-evil-number-keymap (key-set func &rest modes)
    `(progn
       ,@(-map
          (lambda (mode)
            `(define-key ,(intern (concat "evil-" mode "-state-map")) (kbd ,key-set)
               ',(intern (concat "evil-numbers/" func)))) `(,@modes))))

(eval
 (macroexpand
  '(set-evil-number-keymap "C-a" "inc-at-pt" "normal" "insert")))
;; (eval
;;  (macroexpand
;;   '(set-evil-number-keymap "C-x" "dec-at-pt" "normal" "insert")))
#+end_src

* Mail
I use mu4e to view emails and use org mode to compose email

Firstly set up send email through gmail smtp server through build in smtp server, and use authinfo auth method
#+begin_src emacs-lisp :tangle config.el
(setq message-send-mail-function 'smtpmail-send-it
  smtpmail-stream-type 'starttls
  smtpmail-default-smtp-server "smtp.gmail.com"
  smtpmail-smtp-server "smtp.gmail.com"
  smtpmail-smtp-service 587)

(setq org-msg-options "html-postamble:nil H:5 num:nil ^:{} toc:nil author:nil email:nil \\n:t"
      org-msg-startup "hidestars indent inlineimages"
      org-msg-greeting-fmt "\nHi%s,\n"
      org-msg-convert-citation t
      org-msg-signature "
Regards,

,#+begin_signature
,*Xiong ChenYu*
/One Emacs to rule them all/
,#+end_signature")
#+end_src

Then setup use external software mbsync (*isync* on /Mac/) to download the mail
#+begin_src emacs-lisp :tangle config.el
(setq mu4e-attachment-dir "~/Downloads/"
      mu4e-get-mail-command "mbsync -a -q"
      mu4e-update-interval 100
      mu4e-view-show-images t
      mu4e-view-prefer-html t
      message-kill-buffer-on-exit t
      mu4e-headers-auto-update t)

#+end_src

Need some optimization for Gmail because gmail uses labels as folders we can use lazy check since messages don't really "move"
#+begin_src emacs-lisp :tangle config.el
(setq +mu4e-gmail-accounts '("xiongchenyu6@gmail.com" . "/xiongchenyu6"))
;; don't need to run cleanup after indexing for gmail
(setq mu4e-index-cleanup nil
      mu4e-index-lazy-check t)
#+end_src
* IRC
#+begin_src emacs-lisp :tangle config.el
(defun my-fetch-password (&rest params)
  (require 'auth-source)
  (let ((match (car (apply #'auth-source-search params))))
    (if match
        (let ((secret (plist-get match :secret)))
          (if (functionp secret)
              (funcall secret)
            secret))
      (error "Password not found for %S" params))))

(defun my-nickserv-password (server)
  (my-fetch-password :user "freemanX" :host "irc.libera.chat")
  )

(set-irc-server! "irc.libera.chat"
  '(:tls t
    :port 6697
    :nick "freemanX"
    :sasl-username "freemanX"
    :sasl-password my-nickserv-password
    :channels ("#emacs")))
#+end_src

* Coding
** Code complete
If you want to replace it with yasnippet's default snippets uncomment the code and use ~:ignore~ keyword to comment out doom snippets
#+begin_src emacs-lisp :tangle packages.el
(package! doom-snippets) ;;:ignore t)
;; (package! yasnippet-snippets)
;(package! company-tabnine)
#+end_src

#+begin_src emacs-lisp :tangle config.el
(define-key evil-insert-state-map (kbd "C-n") 'company-select-next-or-abort)
(define-key evil-insert-state-map (kbd "C-p") 'company-select-previous-or-abort)

(after!
  company
  (setq company-minimum-prefix-length
        2
        company-tooltip-limit
        20
        company-transformers '(company-sort-by-backend-importance)
        )
  (define-key! company-active-map
    "TAB" nil
    [tab] nil))


(after! yasnippet
  (add-to-list 'yas-snippet-dirs (expand-file-name "~/.snippets"))
  (yas-reload-all)
  )

(after! auto-yasnippet
  (setq aya-persist-snippets-dir "~/.snippets")
  )
;; (use-package! company-tabnine
;;   :after company
;;   :config
;;   (set-company-backend! '(sql-mode conf-mode) '(company-yasnippet :with company-capf :with company-tabnine))
;;   )
#+end_src
** Language server
#+begin_src emacs-lisp :tangle config.el
(setq lsp-file-watch-threshold nil)
(setq lsp-auto-guess-root t)

(setq lsp-ui-doc-use-webkit t)
(setq lsp-ui-doc-max-height 99)
(setq lsp-ui-doc-max-width 9999)

(setq-default lsp-semantic-tokens-enable t)
(setq-default lsp-semantic-tokens-mode t)
#+end_src

** Debugger
#+begin_src emacs-lisp :tangle config.el
(setq
 gdb-many-windows t
 gdb-show-main t)
#+end_src
** Git
Set magit directory to $HOME/workspace and set max search depth to 2
#+begin_src emacs-lisp :tangle config.el
(setq magit-repository-directories '(("~/workspace" . 2)))
#+end_src
* Programming Language
** Cpp

#+begin_src emacs-lisp :tangle packages.el
(package! ccls :disable t)
(package! semantic-refactor)
#+end_src
#+begin_src emacs-lisp :tangle config.el
(after! lsp-clients
  (set-lsp-priority! 'clangd 1))

(after! cc-mode
  (setq semantic-mode 1)
  (map!
   :map (c-mode-map c++-mode-map)
   (:localleader
    :n "r" #'srefactor-refactor-at-point
    ))
  )

(after! projectile
  (projectile-register-project-type 'cmake '("CMakeLists.txt")
                                    :project-file "CMakeLists.txt"
                                    :configure #'projectile--cmake-configure-command
                                    :compile #'projectile--cmake-compile-command
                                    :test #'projectile--cmake-test-command
                                    :run "./build/main"
                                    :install "cmake --build build --target install"
                                    :package "cmake --build build --target package"))
#+end_src
** Clojure
#+begin_src emacs-lisp :tangle config.el
(add-to-list '+debugger--dap-alist '((:lang clojure +lsp) :after clojure-mode :require dap-chrome))
#+end_src
** Cmake
#+begin_src emacs-lisp :tangle config.el
(add-hook! 'cmake-mode-hook #'lsp-deferred)
#+end_src
** Haskell
#+begin_src emacs-lisp :tangle config.el
(setq haskell-process-type 'cabal-new-repl)
(after! haskell-mode
  (map!
   :map haskell-mode-map
   ;; this is set to use cabal for dante users and stack for intero users:
   (:localleader
    (:prefix ("r" . "repl")
     :n "l" #'haskell-process-load-or-reload
     :n "d" #'haskell-process-reload-devel-main )
    )))
#+end_src
** lisp
#+begin_src emacs-lisp :tangle config.el
(set-lookup-handlers! 'emacs-lisp-mode :documentation #'helpful-at-point)

(set-lookup-handlers! 'emacs-library-link :documentation )

(after! lispy
  (setq lispy-outline "^;; \\(?:;[^#]\\|\\*+\\)"
        lispy-outline-header ";; "
        lispy-ignore-whitespace t)
  (map! :map lispy-mode-map
        :i "M-)" #'lispy-parens-auto-wrap
        :i "M-}" #'lispy-braces-auto-wrap
        :i "M-]" #'lispy-brackets-auto-wrap
        :i "_" #'special-lispy-different
        :i [remap delete-backward-char] #'lispy-delete-backward)
  )

(after! evil-mc
  (add-to-list 'evil-mc-incompatible-minor-modes 'lispy-mode))

#+end_src
** Org
#+begin_src emacs-lisp :tangle packages.el
(package! ox-gfm)
(package! ob-mermaid)
(package! mermaid-mode)
#+end_src

#+begin_src emacs-lisp :tangle config.el
(setq org-log-done "time"
      org-log-done-with-time 't)
(setq org-catch-invisible-edits 'show-and-error)
(setq org-cycle-separator-lines 0)


(setq org-hugo-auto-set-lastmod 't
org-hugo-section "posts"
org-hugo-suppress-lastmod-period 43200.0
org-hugo-export-creator-string "Emacs 28.05 (Org mode 9.4 + ox-hugo + XiongChenYu)"
)
(setq rmh-elfeed-org-files '("~/Dropbox/Org/fun/elfeed.org"))

(setq deft-directory "~/Dropbox/Org")

(setq org-directory "~/Dropbox/Org"
      org-agenda-files
      (list org-directory)
      org-agenda-diary-file
      (concat org-directory "/todo.org")
      org-default-notes-file
      (concat org-directory "/notes.org"))

(setq org-src-preserve-indentation t
      org-return-follows-link t)

(map!
 :map (org-mode-map)
 :i "<S-return>" #'org-insert-subheading)

(advice-remove #'org-export-output-file-name #'+org*export-output-file-name)

(require 'org)
(require 'ox-latex)
(add-to-list 'org-latex-packages-alist '("" "minted"))
(setq org-latex-listings 'minted)

(setq org-src-fontify-natively t)

(setq org-latex-compiler "pdflatex --shell-escape %f")
(setq org-html-htmlize-output-type 'css)
(eval-after-load "org"
  '(require 'ox-gfm nil t))

(require 'org-tempo)
(add-to-list 'org-structure-template-alist '("sh" . "src sh"))
(add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
(add-to-list 'org-structure-template-alist '("sc" . "src scheme"))
(add-to-list 'org-structure-template-alist '("ts" . "src typescript"))
(add-to-list 'org-structure-template-alist '("py" . "src python"))
(add-to-list 'org-structure-template-alist '("go" . "src go"))
(add-to-list 'org-structure-template-alist '("yaml" . "src yaml"))
(add-to-list 'org-structure-template-alist '("json" . "src json"))
#+end_src


Use roam to manage the notes and journal
#+begin_src emacs-lisp :tangle config.el

(setq org-roam-directory "~/Dropbox/Notes/"
      org-roam-capture-templates
      '(("d" "default" plain "%?"
          :target (file+head "${slug}.org" "#+title: ${title}\n#+date: %U\n")
          :unnarrowed t
          :immediate-finish t)))
#+end_src
[[id:5ebde5d6-d732-481f-b625-0e83a396319e][Haskell]]
*** literate programming
Tangle-on-save has revolutionized my literate programming workflow. It automatically runs =org-babel-tangle= upon saving any org-mode buffer, which means the resulting files will be automatically kept up to date. For a while I did this by manually adding =org-babel-tangle= to the =after-save= hook in Org mode, but now I use the [[https://github.com/yilkalargaw/org-auto-tangle][org-auto-tangle]] package, which does this asynchronously and selectively for each Org file where it is desired.

#+begin_src emacs-lisp :tangle packages.el
(package! org-auto-tangle)
#+end_src
#+begin_src emacs-lisp :tangle config.el
(use-package! org-auto-tangle
 ; :defer t
  :hook (org-mode . org-auto-tangle-mode)
  :config
  (setq org-auto-tangle-default t))
#+end_src
** Protobuf
#+begin_src emacs-lisp :tangle packages.el
(package! protobuf-mode)
#+end_src
** Python
#+begin_src emacs-lisp :tangle config.el
(setq lsp-pyls-plugins-autopep8-enabled nil)
(setq lsp-pyls-plugins-yapf-enabled t)
#+end_src
- Plantuml
#+begin_src emacs-lisp :tangle config.el
(setq plantuml-default-exec-mode 'jar)
#+end_src
** Prometheus
#+begin_src emacs-lisp :tangle config.el
(define-derived-mode prometheus-v2-rules-mode yaml-mode "prometheus rule" ())

(add-to-list 'auto-mode-alist '("\\.rules$" . prometheus-v2-rules-mode))

(require 'flycheck)
(flycheck-define-checker prometheus-v2-promtool-rules
  "A prometheus rules checker using promtool.
  See URL `https://github.com/prometheus/prometheus/tree/master/cmd/promtool'."
  :command ("promtool" "check" "rules" (eval (expand-file-name (buffer-file-name))))
  :standard-input t
  :error-patterns
  ((error (zero-or-more not-newline) "\n"
          (zero-or-more not-newline) "\n"
          (zero-or-more not-newline)
          (zero-or-more "\n")
          " line " line ":" (message)))
  :modes prometheus-v2-rules-mode)

(add-to-list 'flycheck-checkers 'prometheus-v2-promtool-rules)

#+end_src

** Sql
#+begin_src emacs-lisp :tangle config.el
(add-hook! 'sql-mode-hook #'lsp-deferred)
#+end_src
** Yaml
#+begin_src emacs-lisp :tangle config.el
(setq lsp-yaml-schemas '(:kubernetes "/*-k8s.yaml"))
#+end_src
** Web
#+begin_src emacs-lisp :tangle config.el

;; (setq js-indent-level 2)
;; (setq css-indent-offset 2)
#+end_src
* Utils
** remove windows carrage returns
#+begin_src emacs-lisp :tangle config.el
(defun delete-carrage-returns ()
  (interactive)
  (save-excursion
    (goto-char 0)
    (while (search-forward "\r" nil :noerror)
      (replace-match ""))))
#+end_src
* Tools
** Leetcode
#+begin_src emacs-lisp :tangle config.el
(setq leetcode-prefer-language "cpp")
(setq leetcode-prefer-sql "mysql")
#+end_src
** wakatime

#+begin_src emacs-lisp :tangle packages.el
(package! wakatime-mode)
#+end_src
#+begin_src emacs-lisp :tangle config.el
(use-package wakatime-mode)
(global-wakatime-mode)

(add-hook! wakatime-mode
  (setq wakatime-cli-path "wakatime")
)

#+end_src
